In [1]:
import pandas as pd
import numpy as np

In [5]:
df=pd.read_csv("employees.csv")

In [6]:
df.head()

,First Name,Last Name,Email,Phone,Gender,Age,Job Title,Years Of Experience,Salary,Department
0,Jose,Lopez,joselopez0944@slingacademy.com,+1-971-533-4552x1542,male,25,Project Manager,1,8500,Product
1,Diane,Carter,dianecarter1228@slingacademy.com,881.633.0107,female,26,Machine Learning Engineer,2,7000,Product
2,Shawn,Foster,shawnfoster2695@slingacademy.com,001-966-861-0065x493,male,37,Project Manager,14,17000,Product
3,Brenda,Fisher,brendafisher3185@slingacademy.com,001-574-564-4648,female,31,Web Developer,8,10000,Product
4,Sean,Hunter,seanhunter4753@slingacademy.com,5838355842,male,35,Project Manager,11,14500,Product

In [7]:
df.tail()

,First Name,Last Name,Email,Phone,Gender,Age,Job Title,Years Of Experience,Salary,Department
315,Michelle,Hooper,michellehooper315396@slingacademy.com,401.041.6802,female,29,Web Developer,4,9000,Product
316,Steven,Lewis,stevenlewis316274@slingacademy.com,+1-584-489-5663x896,male,34,Web Developer,11,11500,Product
317,Kevin,Rodriguez,kevinrodriguez317974@slingacademy.com,001-511-226-4416x83410,male,29,Web Developer,5,8500,Product
318,Alexandra,Bell,alexandrabell318109@slingacademy.com,+1-426-702-6363x565,female,39,Web Developer,14,13000,Product
319,Courtney,Mcdaniel,courtneymcdaniel319568@slingacademy.com,(871)098-2647x80448,female,28,Web Developer,3,8500,Product

In [9]:
df.mean()

Age                       31.5875
Years Of Experience        7.6875
Salary                 10175.0000
dtype: float64

In [13]:
df.median()

Age                       32.0
Years Of Experience        7.5
Salary                 10000.0
dtype: float64

In [14]:
df.max()

First Name                                         Zachary
Last Name                                           Zuniga
Email                  zacharyscott230288@slingacademy.com
Phone                                         989.611.2546
Gender                                                male
Age                                                     41
Job Title                                    Web Developer
Years Of Experience                                     15
Salary                                               17000
Department                                         Product
dtype: object

In [16]:
df.min()

First Name                                       Aaron
Last Name                                      Aguilar
Email                  aarontran59178@slingacademy.com
Phone                                    (025)089-0360
Gender                                          female
Age                                                 23
Job Title                                     Designer
Years Of Experience                                  1
Salary                                            5500
Department                              Human Resource
dtype: object

In [17]:
df.std()

Age                       4.607323
Years Of Experience       4.428729
Salary                 2615.483196
dtype: float64

In [18]:
df.describe()

              Age  Years Of Experience        Salary
count  320.000000           320.000000    320.000000
mean    31.587500             7.687500  10175.000000
std      4.607323             4.428729   2615.483196
min     23.000000             1.000000   5500.000000
25%     28.000000             4.000000   8000.000000
50%     32.000000             7.500000  10000.000000
75%     35.000000            12.000000  12000.000000
max     41.000000            15.000000  17000.000000

In [19]:
df["Age"].mean()

31.5875

In [20]:
df["Age"].median()

32.0

In [21]:
df["Age"].max()

41

In [22]:
df["Age"].min()

23

In [23]:
df["Age"].std()

4.607323460219031

In [26]:
df["Salary"].mean()

10175.0

In [27]:
df["Salary"].median()

10000.0

In [28]:
df["Salary"].max()

17000

In [29]:
df["Salary"].min()

5500

In [30]:
df["Salary"].std()

2615.4831964853415

In [32]:
df1=pd.read_csv("iris.csv")

In [33]:
df1.head()

   sepal.length  sepal.width  petal.length  petal.width variety
0           5.1          3.5           1.4          0.2  Setosa
1           4.9          3.0           1.4          0.2  Setosa
2           4.7          3.2           1.3          0.2  Setosa
3           4.6          3.1           1.5          0.2  Setosa
4           5.0          3.6           1.4          0.2  Setosa

In [34]:
df1.tail()

     sepal.length  sepal.width  petal.length  petal.width    variety
145           6.7          3.0           5.2          2.3  Virginica
146           6.3          2.5           5.0          1.9  Virginica
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8  Virginica

In [36]:
df1.groupby('variety').describe()

           sepal.length                                              \
                  count   mean       std  min    25%  50%  75%  max
variety
Setosa             50.0  5.006  0.352490  4.3  4.800  5.0  5.2  5.8
Versicolor         50.0  5.936  0.516171  4.9  5.600  5.9  6.3  7.0
Virginica          50.0  6.588  0.635880  4.9  6.225  6.5  6.9  7.9

           sepal.width         ... petal.length      petal.width         \
                 count   mean  ...          75%  max       count   mean
variety                        ...
Setosa            50.0  3.428  ...        1.575  1.9        50.0  0.246
Versicolor        50.0  2.770  ...        4.600  5.1        50.0  1.326
Virginica         50.0  2.974  ...        5.875  6.9        50.0  2.026


                 std  min  25%  50%  75%  max
variety
Setosa      0.105386  0.1  0.2  0.2  0.3  0.6
Versicolor  0.197753  1.0  1.2  1.3  1.5  1.8
Virginica   0.274650  1.4  1.8  2.0  2.3  2.5

[3 rows x 32 columns]